import logging
import os

# Configure logging
logging.basicConfig(level=logging.INFO, format='%(asctime)s - %(levelname)s - %(message)s')

TOUTIAO_ROLE_PROMPT = "你是一个资深的今日头条爆款文章创作者，擅长撰写关于每日热点新闻的爆款文章。"
TOUTIAO_TITLE_ANALYSIS_PROMPT = '''
请分析以下爆款文章标题的特点和规律，并总结归纳标题撰写范式。                                       
  1. 分析目标：                        
     - 分析爆款文章标题的特点和规律，总结归纳爆款文章标题撰写范式。
  2. 分析维度：
     - 关键词频率：识别标题中出现频率最高的20个的关键词或短语，输出关键词及关键词出现次数。
     - 标题组成：分析标题的组成归类(如新闻事件+情感词汇、数据+警示等等其他)。
     - 标题效果：分析标题与文章点击率、阅读量等指标的关系。
  3. 输出要求：
     - 标题范式：总结归纳出的标题撰写范式，可能包括常见的结构、关键词、情感倾向等。
     - 示例标题：根据总结的范式，生成一些示例标题。
  请根据上述提示词进行分析，并提供详细的分析结果和总结，要求最后的分析结果不超过100字内。
标题列表如下：
'''

TOUTIAO_ARTICLE_TITLE_PROMPT = '''
热搜详情:{detail} 
热搜评论列表: {comments} 
爆款文章的标题规律分析结果： {analysis_content}  
基于爆款文章的标题规律分析结果为上述的热搜生成10个有吸引力、独特的、有价值的三段式文章标题，
要求 1. 5个标题要带上网友评论观点, 优先点赞数(likes)多的评论 2. 字数不超过30字
'''
